ARC-MX/clawd-mochi/esp-idf/sdkconfig.defaults
# Clawd Mochi — ESP-IDF defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# ── Bluetooth (NimBLE peripheral) ──────────────────────────────
# BLE-only, NimBLE host: the lightest way to expose a GATT command
# characteristic alongside WiFi. See CLAUDE-CODE-BRIDGE.md §方案 D.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# Free IRAM for the BT stack (required by IDF's bleprph_wifi_coex example).
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# ── Frame pacing ───────────────────────────────────────────────
# anim.cpp paces playback to ANIM_FPS with vTaskDelay; at the default 100 Hz
# tick a delay is quantised to 10 ms, which is too coarse to hold a steady
# 30 fps. 1000 Hz gives 1 ms granularity.
CONFIG_FREERTOS_HZ=1000
